package kr.co.bestiansoft.ebillservicekg.process.vo;

public class AuthConstants {


	public static final String AUTH_20 = "20";//국회의원 member of parliament
	public static final String AUTH_GD = "GD";//일반부서 General Department (GD)

	public static final String AUTH_LGRV = "LGRV";//법률검토부서 legal department  LGRV review
	public static final String AUTH_CMOFFC = "CMOFFC";//의장실 speaker's office
	public static final String AUTH_LGGSPLZ = "LGGSPLZ";//언어전문파트 Language part

	public static final String AUTH_LGEXNTN = "LGEXNTN";//심사부서 Review department


	public static final String AUTH_LGACT = "LGACT";//Legal Practice Department: Check the grammar and legal terms of the agenda after the meeting of the 1st, 2nd, and 3rd plenary sessions
	//public static final String AUTH_TRSLLGRV = "TRSLLGRV";//Translation language review department



//위원회


//	20	член Конгресса	депутат парламента	국회의원
//	21	GD	общий отдел	일반부서(GD)
//	22	юридикалык бөлүм	юридический отдел	법률부서
//	23	төрага	председатель	의장
//	24	тил боюнча адистик бөлүм	языковой экспертный отдел	언어전문파트
//	25	эксперттик бөлүм	экспертный отдел	심사부서
//	26	юридикалык иш-аракеттер бөлүмү	отдел юридических действий	법적행위부서
//	27	котормо жана тил экспертиза бөлүмү	отдел экспертизы перевода и языков	번역언어심사부서
//	28	укуктук экспертиза бөлүмү	отдел правовой экспертизы	법률검토부서

//	29	Эл аралык иштер, коргоо, коопсуздук жана миграция боюнча комитети	Комитет по международным делам, обороне, безопасности и миграции	국제 문제, 국방, 안보 및 이민 위원회
//	30	Отун-энергетикалык комплекс, жер казынасын пайдалануу жана өнөр жай саясаты боюнча комитети	Комитет по топливно-энергетическому комплексу, недропользованию и промышленной политике	연료&에너지 산업, 지하광물 사용, 산업정책 위원회
//	31	Конституциялык майзамдар, мамлекеттик түзүлүш, сот-укук маселелери жана Жогорку Кеңештин Регламенти боюнча комитети	Комитет по конституционному законодательству, государственному устройству, судебно-правовым вопросам и Регламенту ЖК КР	헌법, 국가조직(행정), 사법 및 법률, 국회규정 위원회
//	32	Бюджет, экономикалык жана фискалдык саясат боюнча комитети	Комитет по бюджету, экономической и фискальной политике	예산, 경제, 재정 정책 위원회
//	33	Агрардык саясат, суу ресурстары, экология жана регионалдык өнүктүрүү боюнча комитети	Комитет по аграрной политике, водным ресурсам, экологии и региональному развитию	농업 정책, 수자원, 생태(환경) 및 지역/지방 개발 위원회
//	34	Социалдык саясат боюнча комитети	Комитет по социальной политике	사회정책 위원회
//	35	Укук тартиби, кылмыштуулук менен күрөшүү жана корруцияга каршы аракеттенүү боюнча комитети	Комитет по правопорядку, борьбе с преступностью и противодействию коррупции	법&질서, 범죄부패 척결 위원회
//	36	Транспорт, коммуникациялар, архитектура жана курулуш боюнча комитети	Комитет по транспорту, коммуникациям, архитектуре и строительству	교통, 통신, 건축&건설 위원회


}
